# [Data Viewing](https://data.compass.lighthouselabs.ca/c5002283-b6b4-4627-afab-03e4f0fc1cf4)

In [3]:
import numpy as np
import pandas as pd

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [5]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [6]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [7]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [8]:
df

                   A         B         C         D
2013-01-01  0.992764 -0.174227 -0.276201  0.443570
2013-01-02 -0.293830  1.758175  0.294730 -0.890338
2013-01-03  0.534938 -0.639450  1.509693  2.373887
2013-01-04  0.865901 -0.200683 -0.598240  0.872558
2013-01-05 -0.751768  0.791015 -0.027431 -0.950642
2013-01-06  0.500512 -2.139318 -0.577430 -0.042233

In [9]:
df2 = pd.DataFrame({'A': 1.0,
    'B': pd.Timestamp('20130102'),
    'C': pd.Series(1, index=list(range(4)), dtype='float32'),
    'D': np.array([3] * 4, dtype='int32'),
    'E': pd.Categorical(["test", "train", "test", "train"]),
    'F': 'foo'})

In [10]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [11]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [12]:
df.head()

                   A         B         C         D
2013-01-01  0.992764 -0.174227 -0.276201  0.443570
2013-01-02 -0.293830  1.758175  0.294730 -0.890338
2013-01-03  0.534938 -0.639450  1.509693  2.373887
2013-01-04  0.865901 -0.200683 -0.598240  0.872558
2013-01-05 -0.751768  0.791015 -0.027431 -0.950642

In [13]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.865901 -0.200683 -0.598240  0.872558
2013-01-05 -0.751768  0.791015 -0.027431 -0.950642
2013-01-06  0.500512 -2.139318 -0.577430 -0.042233

In [14]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [16]:
df.to_numpy()

array([[ 0.99276406, -0.17422734, -0.27620063,  0.44357027],
       [-0.29383018,  1.75817522,  0.29473027, -0.89033846],
       [ 0.53493823, -0.63945001,  1.50969266,  2.37388681],
       [ 0.86590121, -0.20068319, -0.59824025,  0.87255782],
       [-0.75176816,  0.79101509, -0.02743102, -0.95064198],
       [ 0.50051204, -2.13931809, -0.57742976, -0.04223259]])

In [17]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-06  0.500512 -2.139318 -0.577430 -0.042233
2013-01-03  0.534938 -0.639450  1.509693  2.373887
2013-01-04  0.865901 -0.200683 -0.598240  0.872558
2013-01-01  0.992764 -0.174227 -0.276201  0.443570
2013-01-05 -0.751768  0.791015 -0.027431 -0.950642
2013-01-02 -0.293830  1.758175  0.294730 -0.890338

In [18]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    0.992764   -0.293830    0.534938    0.865901   -0.751768    0.500512
B   -0.174227    1.758175   -0.639450   -0.200683    0.791015   -2.139318
C   -0.276201    0.294730    1.509693   -0.598240   -0.027431   -0.577430
D    0.443570   -0.890338    2.373887    0.872558   -0.950642   -0.042233

In [19]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  0.443570 -0.276201 -0.174227  0.992764
2013-01-02 -0.890338  0.294730  1.758175 -0.293830
2013-01-03  2.373887  1.509693 -0.639450  0.534938
2013-01-04  0.872558 -0.598240 -0.200683  0.865901
2013-01-05 -0.950642 -0.027431  0.791015 -0.751768
2013-01-06 -0.042233 -0.577430 -2.139318  0.500512

# [Filtering](https://data.compass.lighthouselabs.ca/9ab8b2d5-03e3-4f8d-91c5-d3938ba5b92c)

In [20]:
dates = pd.date_range('20130101', periods=6)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))

In [21]:
df2 = pd.DataFrame({'A': 1.,
'B': pd.Timestamp('20130102'),
'C': pd.Series(1, index=list(range(4)), dtype='float32'),
'D': np.array([3] * 4, dtype='int32'),
'E': pd.Categorical(["test", "train", "test", "train"]),
'F': 'foo'})

In [22]:
df['A'] == df.A

2013-01-01    True
2013-01-02    True
2013-01-03    True
2013-01-04    True
2013-01-05    True
2013-01-06    True
Freq: D, Name: A, dtype: bool

In [23]:
## Getting a column
df['A']

2013-01-01    0.557754
2013-01-02    1.012066
2013-01-03   -0.836469
2013-01-04    0.148943
2013-01-05    0.250872
2013-01-06    0.734249
Freq: D, Name: A, dtype: float64

In [24]:
## Getting rows
df[0:3]

                   A         B         C         D
2013-01-01  0.557754 -0.381970  0.953791  1.600141
2013-01-02  1.012066  1.626658 -0.204020  0.983700
2013-01-03 -0.836469 -0.386246 -0.664301 -0.866281

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.012066  1.626658 -0.204020  0.983700
2013-01-03 -0.836469 -0.386246 -0.664301 -0.866281
2013-01-04  0.148943 -0.457224 -0.278784  0.790409

In [26]:
## selecting by label
df.loc["2013-01-01"]

A    0.557754
B   -0.381970
C    0.953791
D    1.600141
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
## : represents that we want to take all the rows as well as the list, ['A', 'B'], which represents the columns.
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.557754 -0.381970
2013-01-02  1.012066  1.626658
2013-01-03 -0.836469 -0.386246
2013-01-04  0.148943 -0.457224
2013-01-05  0.250872 -0.806649
2013-01-06  0.734249  2.342880

In [28]:
## slicing labels and columns
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.012066  1.626658
2013-01-03 -0.836469 -0.386246
2013-01-04  0.148943 -0.457224

In [29]:
df.loc['20130102', ['A', 'B']]

A    1.012066
B    1.626658
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0], 'A']

0.5577540373001828

In [31]:
## selecting by position

df.iloc[3]

A    0.148943
B   -0.457224
C   -0.278784
D    0.790409
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
## Using slices
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.148943 -0.457224
2013-01-05  0.250872 -0.806649

In [33]:
## all rows
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.012066  1.626658 -0.204020  0.983700
2013-01-03 -0.836469 -0.386246 -0.664301 -0.866281

In [37]:
df = pd.DataFrame({'string': list('abc'),
'int64': list(range(1, 4)),
'uint8': np.arange(3, 6).astype('u1'),
'float64': np.arange(4.0, 7.0),
'bool1': [True, False, True],
'bool2': [False, True, False],
'dates': pd.date_range('now', periods=3),
'category': pd.Series(list("ABC")).astype('category')})

In [38]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,1,3,4.0,True,False,2022-06-07 10:30:24.631891,A
1,b,2,4,5.0,False,True,2022-06-08 10:30:24.631891,B
2,c,3,5,6.0,True,False,2022-06-09 10:30:24.631891,C

In [35]:
df.select_dtypes(include=[bool])

   bool1  bool2
0   True  False
1  False   True
2   True  False

In [36]:
df[df['float64'] >= 5]

,string,int64,uint8,float64,bool1,bool2,dates,category
1,b,2,4,5.0,False,True,2022-06-08 10:28:43.924404,B
2,c,3,5,6.0,True,False,2022-06-09 10:28:43.924404,C

In [40]:
df2 = df.copy()

In [41]:
df2['E'] = ['one', 'two', 'three']

In [42]:
df2[df2['E'].isin(['one','two'])]

,string,int64,uint8,float64,bool1,bool2,dates,category,E
0,a,1,3,4.0,True,False,2022-06-07 10:30:24.631891,A,one
1,b,2,4,5.0,False,True,2022-06-08 10:30:24.631891,B,two

In [44]:
## set by position
df.iat[0, 1] = -1

df.iloc[0, 1] = 2

In [46]:
df.at[0, 'float64'] = -10
df.loc[0, 'float64'] = -20

In [47]:
df.loc[:, 'uint8'] = np.array([50] * len(df))

In [48]:
df

,string,int64,uint8,float64,bool1,bool2,dates,category
0,a,2,50,-20.0,True,False,2022-06-07 10:30:24.631891,A
1,b,2,50,5.0,False,True,2022-06-08 10:30:24.631891,B
2,c,3,50,6.0,True,False,2022-06-09 10:30:24.631891,C